<template>
        <div class="grid__column user__wrapper">
            <section class="paper user">
                <div class="user__profiles">
                    <label class="user__profile user__profile--main">
                        <input class="visually-hidden" type="radio" name="profile" checked>
                        <div class="user__avatar user__avatar--big"><img src="@/assets/images/jpg/avatar.jpg" alt="avatar"></div>
                        <p class="user__name">Ольга</p>
                    </label>
                    <ul class="user__profile-list">
                        <li>
                            <label class="user__profile">
                                <input class="visually-hidden" type="radio" name="profile">
                                <div class="user__avatar">
                                    <!--img(src="./images/jpg/avatar-1.jpg", alt="avatar")-->
                                </div>
                                <p class="user__name">Александр</p>
                            </label>
                        </li>
                        <li>
                            <label class="user__profile">
                                <input class="visually-hidden" type="radio" name="profile">
                                <div class="user__avatar"><img src="@/assets/images/jpg/avatar-1.jpg" alt="avatar"></div>
                                <p class="user__name">Иван</p>
                            </label>
                        </li>
                        <li>
                            <label class="user__profile">
                                <input class="visually-hidden" type="radio" name="profile">
                                <div class="user__avatar"><img src="@/assets/images/jpg/avatar-2.jpg" alt="avatar"></div>
                                <p class="user__name">Степан</p>
                            </label>
                        </li>
                        <li class="user__btn-add">
                            <button class="button-add button-add--green button-add--big" type="button">Добавить профиль</button>
                        </li>
                    </ul>
                </div>
                <div class="user__menu">
                    <ul>
                        <li><a class="user__menu-link user__menu-link--submenu" href=""><svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 410.8 482.9">
                            <path d="M203.6,260.2c0.5,0,1,0,1.6,0c0.2,0,0.4,0,0.6,0c0.3,0,0.7,0,1,0c29.3-0.5,53-10.8,70.5-30.5
    c38.5-43.4,32.1-117.8,31.4-124.9C306.2,51.5,281,26,260.2,14.1C244.7,5.2,226.6,0.4,206.4,0h-0.7c-0.1,0-0.3,0-0.4,0h-0.6
    c-11.1,0-32.9,1.8-53.8,13.7c-21,11.9-46.6,37.4-49.1,91.1c-0.7,7.1-7.1,81.5,31.4,124.9C150.6,249.4,174.3,259.7,203.6,260.2z
     M128.5,107.3c0-0.3,0.1-0.6,0.1-0.8c3.3-71.7,54.2-79.4,76-79.4h0.4c0.2,0,0.5,0,0.8,0c27,0.6,72.9,11.6,76,79.4
    c0,0.3,0,0.6,0.1,0.8c0.1,0.7,7.1,68.7-24.7,104.5c-12.6,14.2-29.4,21.2-51.5,21.4c-0.2,0-0.3,0-0.5,0l0,0c-0.2,0-0.3,0-0.5,0
    c-22-0.2-38.9-7.2-51.4-21.4C121.6,176.2,128.4,107.9,128.5,107.3z"/>
                            <path d="M410.7,383.6c0-0.1,0-0.2,0-0.3c0-0.8-0.1-1.6-0.1-2.5c-0.6-19.8-1.9-66.1-45.3-80.9c-0.3-0.1-0.7-0.2-1-0.3
    c-45.1-11.5-82.6-37.5-83-37.8c-6.1-4.3-14.5-2.8-18.8,3.3c-4.3,6.1-2.8,14.5,3.3,18.8c1.7,1.2,41.5,28.9,91.3,41.7
    c23.3,8.3,25.9,33.2,26.6,56c0,0.9,0,1.7,0.1,2.5c0.1,9-0.5,22.9-2.1,30.9c-16.2,9.2-79.7,41-176.3,41
    c-96.2,0-160.1-31.9-176.4-41.1c-1.6-8-2.3-21.9-2.1-30.9c0-0.8,0.1-1.6,0.1-2.5c0.7-22.8,3.3-47.7,26.6-56
    c49.8-12.8,89.6-40.6,91.3-41.7c6.1-4.3,7.6-12.7,3.3-18.8c-4.3-6.1-12.7-7.6-18.8-3.3c-0.4,0.3-37.7,26.3-83,37.8
    c-0.4,0.1-0.7,0.2-1,0.3C2,314.7,0.7,361,0.1,380.7c0,0.9,0,1.7-0.1,2.5c0,0.1,0,0.2,0,0.3c-0.1,5.2-0.2,31.9,5.1,45.3
    c1,2.6,2.8,4.8,5.2,6.3c3,2,74.9,47.8,195.2,47.8s192.2-45.9,195.2-47.8c2.3-1.5,4.2-3.7,5.2-6.3
    C410.9,415.5,410.8,388.8,410.7,383.6z"/>
                        </svg>
                            <span>Редактирование профиля</span></a>
                            <div class="user__submenu-wrap">
                                <ul class="user__submenu">
                                    <li><a class="user__menu-link" href="">
                                        <div class="user__avatar"><img src="@/assets/images/jpg/avatar.jpg" alt="avatar"></div>
                                        <p class="user__name">Ольга</p></a></li>
                                    <li><a class="user__menu-link" href="">
                                        <div class="user__avatar"><img src="@/assets/images/jpg/avatar-1.jpg" alt="avatar"></div>
                                        <p class="user__name">Иван</p></a></li>
                                    <li><a class="user__menu-link" href="">
                                        <div class="user__avatar"><img src="@/assets/images/jpg/avatar-2.jpg" alt="avatar"></div>
                                        <p class="user__name">Степан</p></a></li>
                                </ul>
                            </div>
                        </li>
                        <li><a class="user__menu-link" href=""><svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 32 32">
                            <path d="M29.3,3H25V1c0-0.6-0.4-1-1-1s-1,0.4-1,1v2h-6V1c0-0.6-0.4-1-1-1s-1,0.4-1,1v2H9V1c0-0.6-0.4-1-1-1
    S7,0.4,7,1v2H2.7C1.2,3,0,4.2,0,5.7v23.7C0,30.8,1.2,32,2.7,32h26.7c1.5,0,2.7-1.2,2.7-2.7V5.7C32,4.2,30.8,3,29.3,3z M30,29.3
    c0,0.4-0.3,0.7-0.7,0.7H2.7C2.3,30,2,29.7,2,29.3V5.7C2,5.3,2.3,5,2.7,5H7v2c0,0.6,0.4,1,1,1s1-0.4,1-1V5h6v2c0,0.6,0.4,1,1,1
    s1-0.4,1-1V5h6v2c0,0.6,0.4,1,1,1s1-0.4,1-1V5h4.3C29.7,5,30,5.3,30,5.7V29.3z"/>
                            <rect x="7" y="12" width="4" height="3"/>
                            <rect x="7" y="17" width="4" height="3"/>
                            <rect x="7" y="22" width="4" height="3"/>
                            <rect x="14" y="22" width="4" height="3"/>
                            <rect x="14" y="17" width="4" height="3"/>
                            <rect x="14" y="12" width="4" height="3"/>
                            <rect x="21" y="22" width="4" height="3"/>
                            <rect x="21" y="17" width="4" height="3"/>
                            <rect x="21" y="12" width="4" height="3"/>
                        </svg>
                            <span>Дневник</span></a></li>
                        <li><router-link class="user__menu-link active" to="/purchases"><svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 24 20">
                            <path d="M4.6,5l4.7-4.7C9.5,0.1,9.7,0,10,0c0.6,0,1,0.5,1,1c0,0.3-0.1,0.5-0.3,0.7L7.4,5H4.6z M16.6,5h2.9l-4.7-4.7
	C14.5,0.1,14.3,0,14,0c-0.6,0-1,0.5-1,1c0,0.3,0.1,0.5,0.3,0.7L16.6,5z M20.3,9L20.3,9l-3.6,9H7.4L3.8,9l0,0H20.3z M24,7H0v2h0.6
	c0.5,0,1,0.3,1.3,0.8L6,20h12l4.1-10.2C22.3,9.3,22.8,9,23.4,9H24C24,9,24,7,24,7z M10,12c0-0.6-0.4-1-1-1s-1,0.4-1,1v3
	c0,0.6,0.4,1,1,1s1-0.4,1-1V12z M13,12c0-0.6-0.4-1-1-1s-1,0.4-1,1v3c0,0.6,0.4,1,1,1s1-0.4,1-1V12z M16,12c0-0.6-0.4-1-1-1
	s-1,0.4-1,1v3c0,0.6,0.4,1,1,1s1-0.4,1-1V12z"/>
                        </svg>
                            <span>Покупки</span></router-link></li>
                        <li><a class="user__menu-link" href=""><svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 43.6 39.1">
                            <path d="M6.6,35.8C7.5,35.4,8.2,35,9,34.7c0.5-0.2,1-0.5,1.5-0.7c0.3-0.2,0.7-0.2,1.1,0
    c1.9,0.9,3.8,1.8,5.7,2.7c0.7,0.3,1,1,0.7,1.7c-0.3,0.7-1,0.9-1.7,0.6c-1.6-0.7-3.2-1.4-4.7-2.2c-0.3-0.2-0.6-0.2-0.9,0
    c-1.6,0.7-3.1,1.5-4.7,2.2c-1,0.4-1.9-0.2-1.9-1.3c0-2.1,0-4.2,0-6.3c0-0.3-0.1-0.6-0.3-0.9c-1.4-1.8-2.4-3.9-3.1-6.1
    C0,22-0.2,19.5,0.2,17.1c0.7-4.8,3.1-8.7,6.7-11.8c2.3-1.9,4.9-3.3,7.7-4.2c3.3-1,6.7-1.3,10.1-0.9
    c4.7,0.6,8.9,2.4,12.5,5.5C40,8.2,42,11.3,43,15c0.6,2.4,0.7,4.9,0.4,7.3c-0.5,3.2-1.7,6.1-3.7,8.7
    c-2.1,2.7-4.6,4.7-7.8,5.9c-2.1,0.8-4.2,1.2-6.4,0.9c-1.3-0.2-2.6-0.6-3.7-1.5c-0.6-0.5-1-1.1-1.4-1.8
    c-0.6-1.2-0.8-2.4-1.2-3.6c-0.4-1.3-1-2.4-2.1-3.1c-1.1-0.8-1.9-1.8-2.3-3.1c-0.3-1.1-0.2-2.3,0.1-3.4
    c0.5-1.8,1-3.7,1.6-5.5c0.5-1.9,1.1-3.9,1.6-5.8c0.1-0.2,0.1-0.4,0.2-0.7c0.2-0.6,0.9-1,1.5-0.9c0.7,0.2,1.1,0.8,0.9,1.5
    c-0.6,2.4-1.2,4.7-1.8,7.1c-0.3,1-0.5,2.1-0.8,3.2c-0.2,0.7,0.2,1.4,0.9,1.6c0.6,0.2,1.3-0.2,1.5-0.9c0.2-1,0.4-2,0.6-3
    c0.4-1.9,0.7-3.8,1.1-5.8c0.1-0.6,0.2-1.2,0.3-1.8c0.1-0.7,0.7-1.1,1.4-1c0.6,0.1,1.1,0.7,1.1,1.3
    c-0.1,0.6-0.2,1.2-0.3,1.7c-0.2,1.2-0.4,2.4-0.6,3.6c-0.3,1.6-0.6,3.3-0.9,4.9c0,0.3-0.1,0.7,0,1c0.2,0.6,0.7,0.8,1.3,0.8
    c0.5-0.1,1-0.5,1-1.1c0.2-2.4,0.5-4.9,0.7-7.3c0.1-1,0.2-1.9,0.3-2.9c0.1-0.8,0.7-1.2,1.4-1.1c0.7,0.1,1.1,0.8,1.1,1.5
    c-0.1,1.5-0.2,3-0.4,4.5c-0.2,2.1-0.3,4.1-0.5,6.2c0,0.6,0,1.2-0.1,1.8c-0.1,0.6-0.3,1.3-0.5,1.9c-0.4,1-1.3,1.6-2.3,2
    c-0.5,0.2-1,0.3-1.5,0.6c-1.4,0.7-1.9,2-1.5,3.4c0.4,1.8,1.9,3,3.7,3.2c1.8,0.2,3.5-0.2,5.2-0.8c3.2-1.3,5.6-3.6,7.4-6.5
    c1.7-2.8,2.5-5.8,2.4-9c-0.1-3.8-1.6-7.2-4.1-10c-2.2-2.4-4.8-4.2-7.9-5.3c-3-1.1-6.2-1.5-9.4-1.2c-2.8,0.3-5.4,1-7.8,2.3
    c-3.6,1.9-6.4,4.7-8.1,8.5c-1.1,2.4-1.5,4.9-1.2,7.6c0.3,3.1,1.5,5.9,3.4,8.3c0.4,0.5,0.5,1,0.5,1.5c0,1.5,0,3.1,0,4.6
    C6.6,35.5,6.6,35.6,6.6,35.8"/>
                        </svg>
                            <span>Меню</span></a></li>
                        <li><a class="user__menu-link" href=""><svg xmlns="http://www.w3.org/2000/svg" viewBox="0 0 347.8 470.6">
                            <path d="M265.7,0H28.8C12.9,0,0,13,0,28.9v412.9c0,15.9,12.9,28.9,28.8,28.9H319c15.9,0,28.9-12.9,28.9-28.9V89.2L265.7,0z
     M272.5,43.2l36,39.1h-36V43.2z M323.6,441.7c0,2.5-2.1,4.6-4.6,4.6H28.8c-2.5,0-4.6-2.1-4.6-4.6V28.9c0-2.5,2.1-4.6,4.6-4.6h219.4
    v70.2c0,6.7,5.4,12.1,12.1,12.1h63.2L323.6,441.7L323.6,441.7L323.6,441.7z"/>
                        </svg>
                            <span>Блог</span></a></li>
                        <li><a class="user__menu-link" href=""><svg  xmlns="http://www.w3.org/2000/svg" viewBox="0 0 28.6 31.7">
                            <rect y="11" width="3" height="20.7"/>
                            <rect x="8.5" width="3" height="31.7"/>
                            <rect x="17" y="11" width="3" height="20.7"/>
                            <rect x="25.5" y="0" width="3" height="31.7"/>
                        </svg>
                            <span>Статистика</span></a></li>
                    </ul>
                </div>
            </section>
        </div>
</template>

<script>
    export default {
        name: "AppProfile"
    }
</script>

<style scoped>

</style>